q1=input("привет,как тебя зовут?")

q2=int(input("привет," + q1 +" сколько тебе лет?"))

print("ого,тебе уже "+str(q2))

q3=input("как твои дела?")

q4=input("у меня тоже "+q3+" как тебе погода сегодня?")

q5=input("классно,ты думаешь мы сможем подружиться?")
print("я пойму любой твой ответ")

print("окей,я пойду,у меня много дел. успехов тебе!")

print("я вернулся!")
q6=input("ну так что,ты ответишь на мой вопрос? мы сможем подружиться?")
if q6=="да":
    print("окей,я уважаю твой выбор,я рад что ты выбрал " +q6)
if q6=="нет":
    print("ну..ничего..я переживу это")















































